# --- Read RTL
read_verilog rtl/mac_unit.v
read_verilog rtl/systolic_array.v
hierarchy -top systolic_array

# --- Normalize & expose arithmetic
proc; opt
fsm; opt
memory; opt
wreduce; share -aggressive
alumacc; opt
techmap; opt
flatten
wreduce; opt_clean

# --- Map to Sky130
read_liberty -lib /home/skanda/.volare/volare/sky130/versions/bdc9412b3e468c102d01b7cf6337be06ec6e9c9a/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
dfflibmap -liberty /home/skanda/.volare/volare/sky130/versions/bdc9412b3e468c102d01b7cf6337be06ec6e9c9a/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc        -liberty /home/skanda/.volare/volare/sky130/versions/bdc9412b3e468c102d01b7cf6337be06ec6e9c9a/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib -D 10000

# --- Report & write
stat -liberty /home/skanda/.volare/volare/sky130/versions/bdc9412b3e468c102d01b7cf6337be06ec6e9c9a/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog build/systolic_array_synth.v
